tutorials/heatTransfer/buoyantBaffleSimpleFoam/circuitBoardCooling/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    floor
    {
        type            wall;
        nFaces          40;
        startFace       1526;
    }
    ceiling
    {
        type            wall;
        nFaces          40;
        startFace       1566;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       1606;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1626;
    }
    fixedWalls
    {
        type            empty;
        nFaces          1600;
        startFace       1646;
    }
    baffle1Wall_0
    {
        type            directMappedWall;
        nFaces          7;
        startFace       3246;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     baffle1Wall_1;
        offsetMode      uniform;
        offset          (0 0 0);
    }
    baffle1Wall_1
    {
        type            directMappedWall;
        nFaces          7;
        startFace       3253;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     baffle1Wall_0;
        offsetMode      uniform;
        offset          (0 0 0);
    }
    baffle2Wall_0
    {
        type            directMappedWall;
        nFaces          7;
        startFace       3260;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     baffle2Wall_1;
        offsetMode      uniform;
        offset          (0 0 0);
    }
    baffle2Wall_1
    {
        type            directMappedWall;
        nFaces          7;
        startFace       3267;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     baffle2Wall_0;
        offsetMode      uniform;
        offset          (0 0 0);
    }
)

// ************************************************************************* //
